:PROPERTIES:
:ID:       b63bd62f-7045-4aad-a183-023c1ede5fa8
:END:
#+TITLE: Sway Desktop
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:sh   :tangle-mode (identity #o555)
#+PROPERTY: header-args:conf :tangle-mode (identity #o555)
#+OPTIONS: toc:nil

* Environment

Quick reminder of the environment before proceeding

#+begin_src emacs-lisp :results output
(let* ((+-env-vars '("_DF" "_DATA" "_XS" "_ECTO" "_REPO" "_STEAM" "_FLATPAK" "_FLATPAK_NAME" "DOOMDIR" "_GUIX"))
       (+-env-alist (->> +-env-vars
                         (--annotate (getenv it))
                         (--> (-lambda (a) (rassoc it))))))
  (--each +-env-alist (print it)))
#+end_src

#+RESULTS:
#+begin_example

("/home/dc/.dotfiles" . "_DF")

("/data" . "_DATA")

("/data" . "_XS")

("/data/ecto" . "_ECTO")

("/data/repo" . "_REPO")

("/steam" . "_STEAM")

("/flatpak" . "_FLATPAK")

("flexpak" . "_FLATPAK_NAME")

("/home/dc/.doom.d" . "DOOMDIR")

("/gnu" . "_GUIX")
#+end_example



